theodinproject/odin-kittens/app/controllers/kittens_controller.rb

  def index
    @kittens = Kitten.all
---
SELECT "kittens".* FROM "kittens"

    def find_kitten
      @kitten = Kitten.find(params[:id])
---
SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]